### Aprendizaje Supervisado

#### 1.0 Limpieza de datos

Leer el conjunto de datos a utilizar

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

data = pd.read_excel('../db/futbolistas.xlsx')
data

,Id,Nombre,Liga,Prácticas,Horas_Entrenando,Altura,Precio,Juegos,Gimnasio,Fuma,Nacimiento,Nutriólogo,Horas_Casa
0,1,Jugador 1,1,2,8,1.878248,5.983374e+05,16,Sí,No,1997-10-24,No,13
1,2,Jugador 2,3,6,8,1.896357,5.024140e+05,16,No,No,2001-12-29,No,6
2,3,Jugador 3,1,1,9,1.695546,5.836377e+05,11,No,Sí,2001-11-01,Sí,12
3,4,Jugador 4,1,2,12,1.705128,8.788848e+05,0,No,No,1993-06-12,Sí,6
4,5,Jugador 5,2,5,19,1.770933,1.250968e+06,36,Sí,Sí,1992-01-21,Sí,12
...,...,...,...,...,...,...,...,...,...,...,...,...,...
395,396,Jugador 396,1,2,13,1.780959,1.108607e+06,7,Sí,No,2001-10-31,No,14
396,397,Jugador 397,1,1,9,1.726345,5.961114e+05,14,No,Sí,2000-02-27,Sí,5
397,398,Jugador 398,2,3,9,1.760833,8.408007e+05,0,Sí,Sí,1994-02-24,No,13
398,399,Jugador 399,2,7,19,1.655166,1.241644e+06,4,No,Sí,1999-11-06,No,11
399,400,Jugador 400,3,3,5,1.640850,5.686441e+05,2,No,Sí,1995-08-31,Sí,10

Obtén el tamaño del dataset

In [2]:
data.shape

(400, 13)

Calcular el numero de datos unicos

In [3]:
data.nunique()

Id                  400
Nombre              400
Liga                  3
Prácticas             7
Horas_Entrenando     15
Altura              400
Precio              400
Juegos               40
Gimnasio              2
Fuma                  2
Nacimiento          389
Nutriólogo            2
Horas_Casa           10
dtype: int64

Enlistar la informacion de tipo de variables

In [4]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 400 entries, 0 to 399
Data columns (total 13 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Id                400 non-null    int64
 1   Nombre            400 non-null    object
 2   Liga              400 non-null    int64
 3   Prácticas         400 non-null    int64
 4   Horas_Entrenando  400 non-null    int64
 5   Altura            400 non-null    float64
 6   Precio            400 non-null    float64
 7   Juegos            400 non-null    int64
 8   Gimnasio          400 non-null    object
 9   Fuma              400 non-null    object
 10  Nacimiento        400 non-null    datetime64[ns]
 11  Nutriólogo        400 non-null    object
 12  Horas_Casa        400 non-null    int64
dtypes: datetime64[ns](1), float64(2), int64(6), object(4)
memory usage: 40.8+ KB

Calcular la cantidad de numeros nulos en cada columna

In [5]:
data.isnull().sum()

Id                  0
Nombre              0
Liga                0
Prácticas           0
Horas_Entrenando    0
Altura              0
Precio              0
Juegos              0
Gimnasio            0
Fuma                0
Nacimiento          0
Nutriólogo          0
Horas_Casa          0
dtype: int64

Obtener las caracteristicas estadisticas

In [6]:
data.describe()
# esto es para ver la media, desviación estándar, mínimo, máximo, de cada columna.

,Id,Liga,Prácticas,Horas_Entrenando,Altura,Precio,Juegos,Nacimiento,Horas_Casa
count,400.000000,400.000000,400.000000,400.000000,400.000000,4.000000e+02,400.000000,400,400.000000
mean,200.500000,1.972500,4.015000,11.787500,1.765340,9.754184e+05,20.125000,1996-09-22 03:50:24,9.540000
min,1.000000,1.000000,1.000000,5.000000,1.602264,2.541771e+05,0.000000,1990-02-14 00:00:00,5.000000
25%,100.750000,1.000000,2.000000,8.000000,1.683686,6.644697e+05,10.000000,1993-03-26 12:00:00,7.000000
50%,200.500000,2.000000,4.000000,12.000000,1.757894,9.321129e+05,20.000000,1996-07-31 12:00:00,10.000000
75%,300.250000,3.000000,6.000000,15.000000,1.847087,1.235664e+06,30.250000,2000-03-14 18:00:00,12.000000
max,400.000000,3.000000,7.000000,19.000000,1.948201,2.048746e+06,39.000000,2003-12-25 00:00:00,14.000000
std,115.614301,0.814495,2.039651,4.222786,0.096718,3.745065e+05,11.427416,NaN,2.929994

### Limpieza de datos

#### Columnas que tienen que ser eliminadas

##### Por valores Unicos
- Nacimiento
- Altura
- Nombre

---

##### Por falta de logica
- Horas_Casa
- Id No se necesita, tenemos el index

In [7]:
# Eliminación de columnas innecesarias
data_clean = data.drop(
    ['Nacimiento', 'Altura', 'Nombre', 'Horas_Casa', 'Id'], axis=1)
data_clean.shape

(400, 8)

#### 1.1 Transformación de variables categóricas

In [8]:
data_clean.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 400 entries, 0 to 399
Data columns (total 8 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Liga              400 non-null    int64
 1   Prácticas         400 non-null    int64
 2   Horas_Entrenando  400 non-null    int64
 3   Precio            400 non-null    float64
 4   Juegos            400 non-null    int64
 5   Gimnasio          400 non-null    object
 6   Fuma              400 non-null    object
 7   Nutriólogo        400 non-null    object
dtypes: float64(1), int64(4), object(3)
memory usage: 25.1+ KB

Based on the `data_clean.info()` output, the categorical variables are:

- Gimnasio: (dtype object)
- Fuma: (dtype object)
- Nutriólogo: (dtype object)

> These columns likely contain string values representing categories (e.g., "Yes" or "No", or perhaps different gym names)

Estas variables no las puedo meter a un modelo de regresión lineal, por lo tanto las tengo que transformar a numéricas, en este caso a binarias (0 y 1).

In [9]:
categoricos = data_clean.select_dtypes(include=['object']).columns
categoricos

Index(['Gimnasio', 'Fuma', 'Nutriólogo'], dtype='object')

In [10]:
lista_categoricos = list(categoricos)
lista_categoricos

['Gimnasio', 'Fuma', 'Nutriólogo']

Convierte los datos string en numericos introduciendo variables `dummy` para los atributos de sexo y puerto de embarque

In [27]:
# Convert categorical columns to dummy variables with integer type
data_trans = pd.get_dummies(
    data_clean,
    columns=lista_categoricos,
    drop_first=True,
    dtype=int  # Add this parameter
)
data_trans

,Liga,Prácticas,Horas_Entrenando,Precio,Juegos,Gimnasio_Sí,Fuma_Sí,Nutriólogo_Sí
0,1,2,8,5.983374e+05,16,1,0,0
1,3,6,8,5.024140e+05,16,0,0,0
2,1,1,9,5.836377e+05,11,0,1,1
3,1,2,12,8.788848e+05,0,0,0,1
4,2,5,19,1.250968e+06,36,1,1,1
...,...,...,...,...,...,...,...,...
395,1,2,13,1.108607e+06,7,1,0,0
396,1,1,9,5.961114e+05,14,0,1,1
397,2,3,9,8.408007e+05,0,1,1,0
398,2,7,19,1.241644e+06,4,0,1,0
399,3,3,5,5.686441e+05,2,0,1,1

Comprobar que las categóricas ahora son numéricas

In [29]:
data_trans.info()
# Todo debe ser int64 o float64, pero no objetos como en data_clean

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 400 entries, 0 to 399
Data columns (total 8 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Liga              400 non-null    int64
 1   Prácticas         400 non-null    int64
 2   Horas_Entrenando  400 non-null    int64
 3   Precio            400 non-null    float64
 4   Juegos            400 non-null    int64
 5   Gimnasio_Sí       400 non-null    int64
 6   Fuma_Sí           400 non-null    int64
 7   Nutriólogo_Sí     400 non-null    int64
dtypes: float64(1), int64(7)
memory usage: 25.1 KB

# Scikit Learn

Normaliza los datos utilizando el escalador de datos

In [30]:
# El modelo no puede recibir datos que estén tan lejos unos de otros, por tanto hay q normalizarlos

# Normalizar los datos con sklearn

from sklearn.preprocessing import MinMaxScaler, StandardScaler, RobustScaler